import UIKit

// Task 1

// Для каждого принципа ООП приведите 2-3 примера из жизни.

/*
Абстракция
Инкапсуляция
Наследование
Полиморфизм
*/

/*
 Абстракция: Карта памяти, Велосипед
 
 Инкапсуляция: Посудомоечная машина, тостер
 
 Наследование: Животные - воздушные, наземные, водные
 
 Полиморфизм: Дверная ручка, дверной замок
 
 */

//Task 2

/*
 Для каждого базового понятия ООП приведите 2-3 примера из жизни. Опишите их текстом.
 
 Класс
 Объект
 Свойства объектов
 Методы

 Класс: Телефон
 Обьект: IphoneX
 Свойства обьектов: Черный
 Методы: Имеет возможность звонить
 
 Класс: Человек
 Обьект: Дмитрий
 Свойства обьектов: 29 лет, брюнет
 Методы: пытается сдать дз
 */


